trading-uat.test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://trading-uat.secondstax.com/
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 60
      name: Warm up phase
    - duration: 60
      arrivalRate: 120
      rampTo: 240
      name: Ramp up load
    - duration: 300
      arrivalRate: 120
      rampTo: 360
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/trade"
        count: 100